/* add card section - section title
consent section - add a new card */
"Add new" = "새로 추가";

"Apple Pay" = "Apple Pay";

/* title for bank selection */
"Bank" = "은행";

/* Billing Address - title */
"Billing Address" = "청구지 주소";

/* add card section - billing info */
"Billing country or region" = "청구 국가 또는 지역";

"Card" = "Card";

/* consent section - alert cancel button to delete a consent */
"Cancel" = "취소";

/* Card Info Cell - title */
"Card Information" = "카드 정보";

/* user input validation */
"Card’s expiration date is invalid" = "카드의 만료 날짜가 유효하지 않습니다";

/* consent section - unselect consent and go back to consent list */
"Change" = "변경";

/* consent section - choose a saved card */
"Choose a card" = "카드 선택";

/* billing city placeholder */
"City" = "도시";

/* close button for alert */
"Close" = "닫기";

/* checkout button title for recurring payment */
"Confirm" = "확인";

/* consent section - cvc field placeholder
user input - cvc placeholder */
"CVC" = "CVC";

/* add card section - billing field */
"Email" = "이메일";

/* user input validation */
"Expiry date is required" = "만료 날짜는 필수입니다";

/* add card section - UnionPay warning message */
"For UnionPay, only credit cards can be saved. Click “Pay” to proceed with a one time payment or use another card if you would like to save it for future use." = "UnionPay의 경우 신용카드만 저장할 수 있습니다. “결제”를 클릭하여 1회 결제를 진행하거나, 추후 사용을 위해 다른 카드를 저장하세요.";

/* user input validation */
"Invalid email" = "유효하지 않은 이메일";

/* user input validation */
"Invalid phone number" = "유효하지 않은 전화번호";

/* schema section - invalid schema data */
"Invalid schema" = "유효하지 않은 형식";

/* user input validation */
"Invalid state" = "유효하지 않은 주";

/* add card section - button to switch to consent list */
"Keep using saved cards" = "저장된 카드를 계속 사용";

/* add card section - billing field */
"Name on card" = "카드 이름";

/* payment section separator */
"Or pay with" = "또는 다음으로 결제";

/* checkout button title for one-off payment */
"Pay" = "결제";

/* title for payment sheet */
"Payment Methods" = "결제 수단";

/* add card section - billing field */
"Phone number" = "전화번호";

/* user input validation */
"Please enter your city" = "도시를 입력하세요";

/* country selection view error hint
user input validation */
"Please enter your country" = "국가를 입력하세요";

/* user input validation */
"Please enter your first name" = "이름을 입력하세요";

/* user input validation */
"Please enter your last name" = "성을 입력하세요";

/* user input validation */
"Please enter your name on card" = "카드의 이름을 입력하세요";

/* user input validation */
"Please enter your street" = "주소를 입력하세요";

/* user input validation - bank selection view error hint */
"Please select a bank" = "은행을 선택하세요";

/* billing postal code placeholder */
"Postal code" = "우편번호";

/* consent section - alert confirm button to remove a consent */
"Remove" = "삭제";

/* consent section - alert title for delete a consent */
"Remove %@?" = "%@을(를) 삭제하시겠습니까?";

/* Billing Address - reuse toggle */
"Same as shipping address" = "배송지와 동일";

/* add card section - toggle for card saving */
"Save my card for future payments" = "앞으로 결제를 위해 내 카드 저장";

/* schema section - title of Bank Selection form */
"Select your Bank" = "은행 선택";

/* bank selection placeholder
country selection view placeholder */
"Select..." = "선택...";

/* billing state placeholder */
"State" = "주";

/* billing street placeholder */
"Street" = "주소";

/* consent section - alert message for delete a consent */
"This option will be permanently removed from your saved payment methods." = "이 옵션은 저장된 결제 수단에서 영구적으로 삭제됩니다.";

/* alert message for delete MIT consent */
"This card is used for other payments you've set up with %@. Please contact %@ to update the payment method for these payments before removing this card." = "이 카드는 %@에서 설정한 다른 결제에 사용됩니다. 이 카드를 제거하기 전에 해당 결제 수단을 업데이트하려면 %@에 문의하십시오.";

/* schema payment redirect reminder */
"You will be redirected to complete your payment upon confirmation." = "확인 후 결제를 완료하러 이동합니다.";

/* Apple Pay section - instruction text */
"Click the Apple Pay button below to securely complete your purchase." = "아래의 Apple Pay 버튼을 클릭하여 안전하게 구매를 완료하세요.";


/* billing state placeholder */
"Area" = "지역";

/* billing state placeholder */
"County" = "군";

/* billing state placeholder */
"Department" = "부서";

/* billing state/city placeholder */
"District" = "구";

/* billing state placeholder */
"Do Si" = "도/시";

/* billing postal code placeholder */
"Eircode" = "Eircode";

/* billing state placeholder */
"Emirate" = "토후국(Emirate)";

/* billing state placeholder */
"Island" = "섬";

/* billing state placeholder */
"Oblast" = "주(Oblast)";

/* billing state placeholder */
"Parish" = "교구(Parish)";

/* billing postal code placeholder */
"Pin" = "핀";

/* billing state placeholder */
"Prefecture" = "현(Prefecture)";

/* billing state placeholder */
"Province" = "도";

/* billing city placeholder */
"Suburb" = "교외";

/* billing city placeholder */
"Town" = "우체국 소재지";

/* billing postal code placeholder */
"ZIP code" = "우편번호";

/* RegexInputValidator - shown when a required field is left empty */
"Required" = "필수 선택";

/* RegexInputValidator - shown when input does not match its expected format */
"Please enter a valid value" = "유효한 값을 입력하십시오.";
